<script setup>
import AV from 'leancloud-storage'
AV.init({
    appId: 'eoqcmwvh2rt97nbGb2QBvMk3-gzGzoHsz',
    appKey: '1VZqMQ3JThd1fuTCyCbYTtsK',
    serverURL: 'https://eoqcmwvh.lc-cn-n1-shared.com'
});
// const scenice = [
//  {
//   "name": "景德镇中国陶瓷博物馆",
//   "key": "tcbwg",
//   "tags": [
//    "昌江区",
//    "博物馆"
//   ],
//   "locat": "昌江区",
//   "areaType": "博物馆",
//   "lng": "117.17553",
//   "lat": "29.29324",
//   "address": "江西省景德镇市昌江区昌江开发区紫晶路北湖对面",
//   "desc": "千年瓷都的历史辉煌",
//   "phone": "0798-8253701",
//   "openTime": "09:00-17:00（最晚入园16:30）",
//   "cost": "",
//   "introduction": "景德镇中国陶瓷博物馆位于景德镇市昌江区紫晶北路1号，是国内第一家大型陶瓷专题博物馆，国家一级博物馆、全国节约型公共机构示范单位、全国科普教育基地、全国爱国主义教育示范基地、全国中小学生研学实践教育基地、海峡两岸交流基地。总占地面积5.9万多平方米，建筑面积3.2万平方米，由常设展厅、临时展厅、学术交流区、公共活动空间、休闲商务区、办公区、多功能区、库房区等组成，可满足收藏、展示、研究、培训和教育等各项功能需求。博物馆藏文物藏品自新石器时代陶器和汉唐以来各个不同历史时期的陶瓷名品佳作五万余件，其中国家珍贵文物1600余件，涵括了景德镇千年制瓷历史长河中的代表品种。特别是王步、珠山八友等近现代艺术陶瓷精品，该馆更是品类丰富、学术价值和艺术价值极高，为陶瓷历史文化研究提供了最可靠的实物依据。",
//   "images": []
//  },
//  {
//   "name": "古窑名俗博览区",
//   "key": "gy",
//   "tags": [
//    "昌江区",
//    "5A景区"
//   ],
//   "locat": "昌江区",
//   "areaType": "5A景区",
//   "lng": "117.184813",
//   "lat": "29.28343",
//   "address": "江西省景德镇市昌江区瓷都大道古窑路1号",
//   "desc": "北看故宫·南访古窑",
//   "phone": "0798-8534444",
//   "openTime": "08:00-17:00",
//   "cost": "¥85起",
//   "introduction": "古窑民俗博览区是全国唯一一家以陶瓷文化为主题的国家AAAAA级旅游景区、全国旅游标准化示范景区、全国科普教育基地、全国重点文物保护单位——镇窑、全国重点文物保护单位——明园、国家级非物质文化遗产项目名录——景德镇手工制瓷技艺、国家级非物质文化遗产项目名录——景德镇传统瓷窑作坊营造技艺、江西省第一家座落于城市中心的国家AAAAA级旅游景区。",
//   "images": []
//  },
//  {
//   "name": "瑶里景区",
//   "key": "yl",
//   "tags": [
//    "浮梁县",
//    "4A景区"
//   ],
//   "locat": "浮梁县",
//   "areaType": "4A景区",
//   "lng": "117.59507",
//   "lat": "29.540636",
//   "address": "江西省景德镇市浮梁县瑶里镇",
//   "desc": "瓷之源、茶之乡、林之海",
//   "phone": "0798-2601228",
//   "openTime": "08:00-18:00",
//   "cost": "¥110起",
//   "introduction": "瑶里，古名“窑里”，因是景德镇陶瓷发祥地而得名，远在唐代中叶，这里就有生产陶瓷的手工作坊。瑶里位于举世闻名的瓷都东北端，地处三大世界文化遗产(黄山、庐山、西递和宏村)的中心，素有“瓷之源，茶之乡，林之海”的美称，是国家重点风景名胜区、国家历史文化名镇、国家AAAA级风景区、国家矿山公园、国家森林公园、国家重点文物保护单位、国家自然与文化双遗产。",
//   "images": []
//  },
//  {
//   "name": "御窑博物馆",
//   "key": "yyc",
//   "tags": [
//    "珠山中路",
//    "博物馆"
//   ],
//   "locat": "珠山中路",
//   "areaType": "博物馆",
//   "lng": "117.206239",
//   "lat": "29.296024",
//   "address": "江西省景德镇市珠山区珠山中路187号",
//   "desc": "御窑传承千年,景御留芳百世。",
//   "phone": "0798-8201378",
//   "openTime": "08:30-17:30",
//   "cost": "",
//   "introduction": "明初，景德镇成立了御窑厂，宫廷瓷器开始注明皇帝的年款。 代表东方古老文化的瓷器，素有官窑、民窑之别。官窑，即官方创办的窑厂。封建社会的官窑是专为皇宫内院制造皇上用的瓷和皇帝赏赐臣僚的御瓷的御窑厂。 由于御窑厂的特权所在，历来荟萃着景德镇的陶艺精英和能工巧匠。它虽然专为皇帝烧制瓷器，而客观上则为中华民族创造了大量瓷文化的奇珍异宝。除了不少流失于海外，尚有许多陶艺珍稀品为故宫博物院所珍藏，并向海内外游客作展示。御窑厂是官窑的象征，是陶艺瑰宝的摇篮。历来，人们对御窑厂充满神秘感与好奇心。",
//   "images": []
//  },
//  {
//   "name": "陶溪川",
//   "key": "txc",
//   "tags": [
//    "珠山区",
//    "4A景区"
//   ],
//   "locat": "珠山区",
//   "areaType": "4A景区",
//   "lng": "117.236113",
//   "lat": "29.295502",
//   "address": "江西省景德镇市珠山区新厂西路150号",
//   "desc": "国际陶瓷文化产业园",
//   "phone": "",
//   "openTime": "随时（晚上更好）",
//   "cost": "",
//   "introduction": "陶溪川文创街区坐落于景德镇市东城，总规划面积2平方公里，建有陶瓷工业遗产博物馆、美术馆、陶公塾教育研学基地、邑空间双创平台、国际工作室等。植入多元业态，凸显文化内核。",
//   "images": []
//  },
//  {
//   "name": "高龄·中国村",
//   "key": "dtcs,huahai,flch",
//   "tags": [
//    "浮梁县",
//    "景区"
//   ],
//   "locat": "浮梁县",
//   "areaType": "景区",
//   "lng": "117.467392",
//   "lat": "29.475731",
//   "address": "江西省景德镇市浮梁县鹅湖镇东北部",
//   "desc": "“国家级田园综合体”",
//   "phone": "0798-2768188",
//   "openTime": "08:30-17:30",
//   "cost": "¥126起",
//   "introduction": "按照“一环两带，六园一区”的空间布局。重点建设一条13.6公里长的旅游观光环路，东西两条滨水风光带，以及浮梁茶海、高岭花海、香樟林海、村长学院、智慧农园、界田小村等六大片区和一个游客综合服务区。集生态农业、瓷茶文旅、论坛培训、运动康养、旅居文创等功能业态于一体的“国家级田园综合体”",
//   "images": []
//  }
// ]
// let objects = []
// for(let i of scenice){
//     const testObject = AV.Object('scenic');
//     for(let key in i){
//         testObject.set(key, i[key]);
//     }
//     objects.push(testObject)
// }
// testObject.save().then(function(object) {
//   console.log('Object saved with objectId: ' + object.id);
// });
// AV.Object.saveAll(objects).then(
//   function (savedObjects) {
//     console.log(savedObjects)
//   },
//   function (error) {
//   }
// );
const query = new AV.Query('test2');
query.find().then(function (products) {
      console.log(products,'asdfasdf')
  }).catch(function(error) {
    alert(JSON.stringify(error));
  });
// const query = new AV.Query('test3');
// const data = await query.find()
// console.log(data)
</script>
